app/controllers/age_limits_controller.rb

  def index
    @age_limits = AgeLimit.all
---
SELECT * FROM `age_limits`

  def show
    @age_limit = AgeLimit.find(params[:id])
---
SELECT * FROM `age_limits` WHERE (`age_limits`.`id` = 1)

  def edit
    @age_limit = AgeLimit.find(params[:id])
---
SELECT * FROM `age_limits` WHERE (`age_limits`.`id` = 1)

  def create
    @age_limit = AgeLimit.new(params[:age_limit])

    respond_to do |format|
      if @age_limit.save
---
INSERT INTO `age_limits` (`name`, `updated_at`, `created_at`) VALUES('U', '2010-03-12 16:13:18', '2010-03-12 16:13:18')

  def update
    @age_limit = AgeLimit.find(params[:id])

    respond_to do |format|
      if @age_limit.update_attributes(params[:age_limit])
---
SELECT * FROM `age_limits` WHERE (`age_limits`.`id` = 1)
UPDATE `age_limits` SET `updated_at` = '2010-03-20 11:12:14', `name` = 'General' WHERE `id` = 1

  def destroy
    @age_limit = AgeLimit.find(params[:id])
    @age_limit.destroy
---
SELECT * FROM `age_limits` WHERE (`age_limits`.`id` = 1)
DELETE FROM `age_limits` WHERE `id` = 1