app/controllers/businesses_controller.rb

  def index
    @businesses = Business.all
---
SELECT * FROM `businesses`

  def show
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 1)

  def edit
    @business = Business.find(params[:id])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 8)

  def create

    @business = Business.new(params[:business])


    respond_to do |format|
      if @business.save
---
INSERT INTO `businesses` (`name`, `address`, `city`, `lattitude`, `created_at`, `country`, `updated_at`, `user_id`, `longitude`, `province`) VALUES(NULL, NULL, NULL, NULL, '2010-03-12 23:11:27', NULL, '2010-03-12 23:11:27', NULL, NULL, NULL)

  def update
    @business = Business.find(params[:id])

    respond_to do |format|
      if @business.update_attributes(params[:business])
---
SELECT * FROM `businesses` WHERE (`businesses`.`id` = 8)
UPDATE `businesses` SET `updated_at` = '2010-03-13 14:31:13', `country` = 'Ireland', `lattitude` = 0.0, `address` = 'somewhere', `name` = 'theatre', `city` = 'dublin', `province` = 'any', `longitude` = 0.0 WHERE `id` = 8