app/controllers/event_instances_controller.rb

SELECT * FROM `event_instances` WHERE ((((event_instances.genre_id = 2) AND (event_instances.age_limit_id = 1)) AND (event_instances.start <= '2010-03-18 18:40:00')) AND (event_instances.start >= '2010-03-18 18:30:00'))
SELECT * FROM `categories` LIMIT 1
SELECT * FROM `genres` WHERE (`genres`.`category_id` IS NULL)
---
  def index
    @search = EventInstance.search(params[:search])
    @category_id = params[:category_id]
    if @category_id == "" || @category_id.nil?
      @category_id = Category.first.id
    else
      begin
        @category_id = Integer(@category_id)
      rescue
        @category_id = Category.first.id
      end
    end


    begin
      @genre_id = Integer(params[:search][:genre_id_equals])
    rescue
      @genre_id = 0
    end

    @genres_collection = Genre.find_all_by_category_id(@category_id)

SELECT * FROM `event_instances` WHERE (`event_instances`.`id` = 1)
---
  def show
    @event_instance = EventInstance.find(params[:id])

SELECT * FROM `event_instances` WHERE (`event_instances`.`id` = 2)
---
  def edit
    @event_instance = EventInstance.find(params[:id])

INSERT INTO `event_instances` (`age_limit_id`, `created_at`, `notes`, `updated_at`, `end`, `doorPrice`, `start`, `genre_name`, `ticketPrice`) VALUES(1, '2010-03-18 18:35:37', 'Up', '2010-03-18 18:35:37', '2010-03-18 19:35:00', 10, '2010-03-18 18:35:00', '2', 8)
---
  def create
    @event_instance = EventInstance.new(params[:event_instance])

    respond_to do |format|
      if @event_instance.save

SELECT * FROM `event_instances` WHERE (`event_instances`.`id` = 1)
SELECT * FROM `genres` WHERE (`genres`.`category_id` = 1)
---
  def genre_dropdown
    # renders a genre selection dropdown for use with ajax
    args={}
    if params[:id].nil?
      # Must be for search screen get settings from params
      category_id = params[:category_id]
      if category_id == "" then category_id = nil end
    else
      # Specific event_instance so get settings from self
      category_id = EventInstance.find(params[:id]).category_id
    end
    args[:name] = "genre_id" #params[:name] || "genre_id"
    if category_id.nil?
      category_id = Category.first.id
    end
    args[:collection] = Genre.find_all_by_category_id(category_id)

SELECT * FROM `event_instances` WHERE (`event_instances`.`id` = 1)
DELETE FROM `event_instances` WHERE `id` = 1
---
  def destroy
    @event_instance = EventInstance.find(params[:id])
    @event_instance.destroy