app/controllers/landing_controller.rb

  def index
    @businesses = Business.all
   @search = EventInstance.search(params[:search])
---
SELECT * FROM `businesses`
SELECT * FROM `event_instances`