app/controllers/movies_controller.rb

SELECT * FROM `movies` WHERE (((movies.name LIKE '%A%') AND (movies.duration <= 180)) AND ((movies.duration >= 0) AND (movies.genre = '1')))
---
  def index

       @search = Movie.search(params[:search])

SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
---
  def show
    @movie = Movie.find(params[:id])

SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO `movies` (`name`, `duration`, `created_at`, `updated_at`, `genre`) VALUES('Wilma and Ted', 113, '2010-03-20 12:14:36', '2010-03-20 12:14:36', 'Children')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save