app/controllers/password_resets_controller.rb

def create
@user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'blah') LIMIT 1

def update
@user.password = params[:user][:password]
@user.password_confirmation = params[:user][:password_confirmation]
if @user.save
---
UPDATE `users` SET `updated_at` = '2010-03-06 13:25:26', `crypted_password` = '8a8bbbac9727ebe1695689349e7839d22efe1b85eda5aba122b6c45ee99b41221c1910fdb6c8e19f31692e03b46ba24076691237994900a97c9be23dd48f36da', `perishable_token` = '2ZHzJFEaxuVuHX-pWdIW', `last_login_at` = '2010-03-06 13:22:55', `last_login_ip` = '127.0.0.1', `current_login_at` = '2010-03-06 13:25:26', `password_salt` = '4eS5D0F6T6i2Cs6BSe_m', `login_count` = 2, `persistence_token` = '79372df2dcd3c20cacef01d371122ed90cbbaba644f2b09d63a583dc4594808393ae88b0ad15166f86e184c63823b074fe44f1a0e5c187191c281dd21728fc61', `last_request_at` = '2010-03-06 13:25:26' WHERE `id` = 9