app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC
---
def index
    @posts = Post.all

INSERT INTO `posts` (`created_at`, `updated_at`, `message`) VALUES('2010-03-13 14:47:59', '2010-03-13 14:47:59', 'this is a test comment')
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 6)
---
  def rate
    @post = Post.find(params[:id])