app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-03-06 13:22:57', '2010-03-06 13:22:57', '008eba7d22feabffe37152432941f9104b9e1e91495628a9c8468615abcf06b2c83892ff884b6214cb559fd76ab02e79bd16e9144e84684a3ab2a5a09bbf2518', '2010-03-06 13:22:57', '2fPonAWzCLYmcQeN6yxd', '127.0.0.1', '1kSoBfuUeUiAhpmXjgEr', '2010-03-06 13:22:55', '6f60a73fa30e4fab54d677132846524a540f018df190343f53268cf3639da4aecbd53dc6488ec7b803ad37ffdbfa1f851dcbfd3032b831b1ee2f21f7b7677936', 1, NULL, 'joelafferty', NULL, 'joe.m.lafferty@gmail.com')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-03-13 14:30:22', `crypted_password` = '7a096dbcee133887492e2212b474f327a2905f7204a80290e479d9f3eb41c9479b021ab61e65c568e34f8c8195e689ffee51e8654d1adb7bce33e1a6e01067c8', `perishable_token` = '_Jc7u8eh2ZhOsaakYtoq', `last_login_at` = '2010-03-13 14:16:45', `last_login_ip` = '127.0.0.1', `current_login_at` = '2010-03-13 14:30:22', `password_salt` = '4kMuYB_-fXmk1WaGNTxb', `login_count` = 2, `persistence_token` = 'dad5a917d04f3a2b6dd073824bf9d739aee9265a6b4839b2e7af490a2f113fbf9aa6e6e2af2551ac0c86709ec150937c6ecab7645c667182b22306d07352ab48', `last_request_at` = '2010-03-13 14:30:22' WHERE `id` = 2